<a href="https://colab.research.google.com/github/Ranjitghadge/Python-Practice/blob/main/Python_Notes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
type(5.1)

float

In [ ]:
int(5.1245)

5

In [ ]:
bool(-15884)

True

In [ ]:
a='I am a data scientist'
a[-9:-3]

'scient'

In [ ]:
#len of string
len(a)

21

In [ ]:
#for replace
a.replace("s","T")

'I am a data TcientiTt'

In [ ]:
#create list of string
a.split()

['I', 'am', 'a', 'data', 'scientist']

In [ ]:
a.lower()

'i am a data scientist'

In [ ]:
a.upper()

'I AM A DATA SCIENTIST'

In [ ]:
a.title() #make 1st letter capital

'I Am A Data Scientist'

In [ ]:
a[:5] #return 1st five characters

'I am '

# List

In [ ]:
bikes=['trek','redline','giant']

In [ ]:
#get 1st item
bikes[0]

'trek'

In [ ]:
#last item
bikes[-1]

'giant'

In [ ]:
for i in bikes:
    print(i)

trek
redline
giant

In [ ]:
bikes=['trek','redline','giant']
bikes.append('splendor')
print(bikes)

['trek', 'redline', 'giant', 'splendor']

In [ ]:
cubes=[]

for i in range(0,11):
    cubes.append(i**3)
print(cubes)

[0, 1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [ ]:
cubes=[]

for i in range(0,11):
    cubes.append(i+1)
    print(cubes)

[1]
[1, 2]
[1, 2, 3]
[1, 2, 3, 4]
[1, 2, 3, 4, 5]
[1, 2, 3, 4, 5, 6]
[1, 2, 3, 4, 5, 6, 7]
[1, 2, 3, 4, 5, 6, 7, 8]
[1, 2, 3, 4, 5, 6, 7, 8, 9]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

In [ ]:
cubes=0

for i in range(0,11):
    cubes=(i+1)
    print(cubes)

In [ ]:
#list comprehension
cubes=[i**3 for i in range(0,11)]
print(cubes)

[0, 1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]

In [ ]:
cubes
cubes[:2]  #slicing of list

[0, 1]

In [ ]:
cubes[0]   #returning 1st value of list

0

In [ ]:
list=[1,5,1,4,7,8,9,6,1,12]
list

[1, 5, 1, 4, 7, 8, 9, 6, 1, 12]

In [ ]:
l=[1,5,1,4,7,8,9,6,1,12] #for sum of list element
s=sum(l)
print(s)

TypeError: 'int' object is not callable

In [ ]:
min(l)

1

In [ ]:
l.append(500) #append the value in list
l

[1, 5, 1, 4, 7, 8, 9, 6, 1, 12, 500, 500, 500]

In [ ]:
l.sort() #sort ascending
l

[1, 1, 1, 4, 5, 6, 7, 8, 9, 12, 500, 500, 500]

In [ ]:
l.sort(reverse=True) #sort descending
l

[500, 500, 500, 12, 9, 8, 7, 6, 5, 4, 1, 1, 1]

In [ ]:
bikes=['trek','redline','giant'] #convert list into string
" ".join(['A','B','C','D'])

'A B C D'

In [ ]:
l.reverse() #reverse the list
l

[500, 500, 500, 12, 9, 8, 7, 6, 5, 4, 1, 1, 1]

In [ ]:
l[-5:-3]

[5, 4]

# Tuples

In [ ]:
tuple='ranjit','ramesh','ghadge'
print(tuple)

('ranjit', 'ramesh', 'ghadge')

In [ ]:
#concanetate two tuples
tuple='ranjit','ramesh','ghadge'
tuple2= '25','360','23'
con=(tuple+tuple2)
con

('ranjit', 'ramesh', 'ghadge', '25', '360', '23')

In [ ]:
#slicing of tuple
a=(1,2,4,5,6,7,8,1,0,2,4)
print(a[2:8])

(4, 5, 6, 7, 8, 1)

In [ ]:
a[3:8]

(5, 6, 7, 8, 1)

# Dictionaries

In [ ]:
num={'one':1,'two':2,'three':3}
for word,num in num.items():
    if num%2==0:
        print(num)

2

In [ ]:
num={'one':1,'two':2,'three':3}
for n in num.values():
    print(n)

1
2
3

In [ ]:
num={'one':1,'two':2,'three':3}
for n in num.keys():
    print(n)

one
two
three

In [ ]:
num.values()

dict_values([1, 2, 3])

In [ ]:
num.keys()

dict_keys(['one', 'two', 'three'])

In [ ]:
num.items()

dict_items([('one', 1), ('two', 2), ('three', 3)])

In [ ]:
a=[a,b,v,d,f,g]
first=[a[0] for letter in a]
first

NameError: name 'b' is not defined

In [ ]:
a=['ranjit','ghadge','ramesh']
first=[letter[0] for letter in a]
first

['r', 'g', 'r']

In [ ]:
B=[2,4,6,7,8,2,4,9,7,15,20,3,6]
b=[i**2 for i in B if i%2==0]
b

[4, 16, 36, 64, 4, 16, 400, 36]

In [ ]:
list = ["a", "b", "c", "d"]
a = list[0:]
print(a)

c

In [ ]:

sq = [0, 1, 4, 9, 16, 25, 36, 49, 64]

print(sq[4:])

[16, 25, 36, 49, 64]

In [ ]:
string=input()
a=string[1:-1]
print(a)

names
ame

In [ ]:
list = [1, 1, 2, 3, 5, 8, 13]

print(list[list[4]])

8

In [ ]:
for i in range(10):

  if not i % 2 == 0:

    print(i+1)

2
4
6
8
10

In [ ]:
x = input()
print(x[0:3])

ranjit
ran

In [ ]:
N = int(input())

sum = 0
for i in range(1, N+1):
    sum += i
    print(sum)

In [ ]:
N = int(input())

sum = 0
for i in range(1, N+1):
    sum += i
    print(sum)

5
1
3
6
10
15

In [ ]:
x ="abc"

x *= 2

print(len(x))

6

In [ ]:
x = [2, 4, 5, 7, 4]

y = x.index(4)

print(y)

1

In [ ]:
nums = [1, 3, 5, 2, 4]

res = min(nums) + max(nums)

print(res)

6

In [ ]:
queue = ['John', 'Amy', 'Bob', 'Adam']

imp= input()

queue.append(imp)

print(queue)

wwww
['John', 'Amy', 'Bob', 'Adam', 'wwww']

In [ ]:
nums = [2,4,8,9,5]


nums.insert(1, 3)

nums.remove(9)

nums.insert(0, nums.count(8))

print(nums[3])

4

In [ ]:
nums = [2,4,8,9,5]


nums.insert(1, 3)

nums.remove(9)

nums.insert(0, nums.count(8))

print(nums[3])

4

In [ ]:
nums = [2,4,8,9,5]


nums.insert(1, 3)

print(nums)

[2, 3, 4, 8, 9, 5]

In [ ]:
nums = [4, 5, 7]
msg = "Numbers: {0} {1} {2}". format(nums[0], nums[1], nums[2])
print(msg)

Numbers: 4 5 7

In [ ]:
print("{0}{1}{0}".format("abra", "cad"))

abracadabra

In [ ]:
str="{c}, {b}, {a}".format(a=5, b=9, c=7)

print(str)

7, 9, 5

In [ ]:
x='hello'
words = x.split(' ')
res = words[0]
print(res)

hello

List Comprehension:

Provide a concice way to create a list it consist bracket containing expression follow by for clouse then, zero or mmore for or if clauses this expression can be anything you can put all kinds of object in list.

In [3]:
def sqr(nums):
  l=[]
  for i in nums:
    l.append(i*i)
  return l

nums=[1,2,4,5,6]
print(sqr(nums))

[1, 4, 16, 25, 36]

In [4]:
list1=[i*i for i in nums]
print(list1)

[1, 4, 16, 25, 36]

In [6]:
#If need even nos square
list1=[i*i for i in nums if i%2==0 ]
print(list1)

[4, 16, 36]

In [ ]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily', 'Frank', 'George', 'Helen', 'Irene', 'Jack'],
    'Age': [25, 32, 18, 47, 29, 36, 21, 45, 28, 33],
    'Gender': ['Female', 'Male', 'Male', 'Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Male'],
    'Country': ['USA', 'Canada', 'USA', 'Australia', 'UK', 'Canada', 'USA', 'Australia', 'UK', 'USA'],
    'Salary': [50000, 75000, 40000, 90000, 60000, 80000, 55000, 100000, 65000, 70000],
    'Department': ['Marketing', 'Finance', 'Marketing', 'IT', 'IT', 'HR', 'Marketing', 'IT', 'HR', 'Finance'],
    'Years of Experience': [3, 8, 1, 18, 6, 10, 2, 22, 5, 7],
    'Education Level': ['Bachelor', 'Master', 'High School', 'PhD', 'Bachelor', 'Master', 'Bachelor', 'PhD', 'Bachelor', 'Master']
}

df = pd.DataFrame(data)
print(df)

      Name  Age  Gender    Country  Salary Department  Years of Experience  \
0    Alice   25  Female        USA   50000  Marketing                    3
1      Bob   32    Male     Canada   75000    Finance                    8
2  Charlie   18    Male        USA   40000  Marketing                    1
3    David   47    Male  Australia   90000         IT                   18
4    Emily   29  Female         UK   60000         IT                    6
5    Frank   36    Male     Canada   80000         HR                   10
6   George   21    Male        USA   55000  Marketing                    2
7    Helen   45  Female  Australia  100000         IT                   22
8    Irene   28  Female         UK   65000         HR                    5
9     Jack   33    Male        USA   70000    Finance                    7

  Education Level
0        Bachelor
1          Master
2     High School
3             PhD
4        Bachelor
5          Master
6        Bachelor
7             PhD
8        Bachelor
9          Master

In [ ]:
#For checking a data type
df.dtypes

Name                   object
Age                     int64
Gender                 object
Country                object
Salary                  int64
Department             object
Years of Experience     int64
Education Level        object
dtype: object

In [ ]:
df.head()

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
0,Alice,25,Female,USA,50000,Marketing,3,Bachelor
1,Bob,32,Male,Canada,75000,Finance,8,Master
2,Charlie,18,Male,USA,40000,Marketing,1,High School
3,David,47,Male,Australia,90000,IT,18,PhD
4,Emily,29,Female,UK,60000,IT,6,Bachelor

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 10 non-null     object
 1   Age                  10 non-null     int64
 2   Gender               10 non-null     object
 3   Country              10 non-null     object
 4   Salary               10 non-null     int64
 5   Department           10 non-null     object
 6   Years of Experience  10 non-null     int64
 7   Education Level      10 non-null     object
dtypes: int64(3), object(5)
memory usage: 768.0+ bytes

In [ ]:
#overall discriptive summary of dataframe

df.describe()

             Age         Salary  Years of Experience
count  10.000000      10.000000            10.000000
mean   31.400000   68500.000000             8.200000
std     9.418658   18416.478129             6.860515
min    18.000000   40000.000000             1.000000
25%    25.750000   56250.000000             3.500000
50%    30.500000   67500.000000             6.500000
75%    35.250000   78750.000000             9.500000
max    47.000000  100000.000000            22.000000

In [ ]:
df.shape #for no of rows & columns

(10, 8)

In [ ]:
df.value_counts() #view unique values & counts

Name     Age  Gender  Country    Salary  Department  Years of Experience  Education Level
Alice    25   Female  USA        50000   Marketing   3                    Bachelor           1
Bob      32   Male    Canada     75000   Finance     8                    Master             1
Charlie  18   Male    USA        40000   Marketing   1                    High School        1
David    47   Male    Australia  90000   IT          18                   PhD                1
Emily    29   Female  UK         60000   IT          6                    Bachelor           1
Frank    36   Male    Canada     80000   HR          10                   Master             1
George   21   Male    USA        55000   Marketing   2                    Bachelor           1
Helen    45   Female  Australia  100000  IT          22                   PhD                1
Irene    28   Female  UK         65000   HR          5                    Bachelor           1
Jack     33   Male    USA        70000   Finance     7                    Master             1
dtype: int64

In [ ]:
df.apply (pd.Series.value_counts) #view uniue values & counts for all columns

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
1,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
18,NaN,1.0,NaN,NaN,NaN,NaN,1.0,NaN
21,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN
25,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
45,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
47,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN
40000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
50000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
55000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
60000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
65000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
70000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
75000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
80000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
90000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
100000,NaN,NaN,NaN,NaN,1.0,NaN,NaN,NaN
Alice,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Australia,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN
Bachelor,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0
Bob,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Canada,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN
Charlie,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
David,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Emily,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Female,NaN,NaN,4.0,NaN,NaN,NaN,NaN,NaN
Finance,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN
Frank,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
George,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
HR,NaN,NaN,NaN,NaN,NaN,2.0,NaN,NaN
Helen,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
High School,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
IT,NaN,NaN,NaN,NaN,NaN,3.0,NaN,NaN
Irene,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Jack,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Male,NaN,NaN,6.0,NaN,NaN,NaN,NaN,NaN
Marketing,NaN,NaN,NaN,NaN,NaN,3.0,NaN,NaN
Master,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3.0
PhD,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.0
UK,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN
USA,NaN,NaN,NaN,4.0,NaN,NaN,NaN,NaN

In [ ]:
#Enter string in index
df.index=['1st','2nd','3rd','4th','5th','6th','7th','8th','9th','10th']
df

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor
2nd,Bob,32,Male,Canada,75000,Finance,8,Master
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School
4th,David,47,Male,Australia,90000,IT,18,PhD
5th,Emily,29,Female,UK,60000,IT,6,Bachelor
6th,Frank,36,Male,Canada,80000,HR,10,Master
7th,George,21,Male,USA,55000,Marketing,2,Bachelor
8th,Helen,45,Female,Australia,100000,IT,22,PhD
9th,Irene,28,Female,UK,65000,HR,5,Bachelor
10th,Jack,33,Male,USA,70000,Finance,7,Master

In [ ]:
df.index

Index(['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th'], dtype='object')

In [ ]:
df.columns

Index(['Name', 'Age', 'Gender', 'Country', 'Salary', 'Department',
       'Years of Experience', 'Education Level'],
      dtype='object')

In [ ]:
df['Age'] # return column with label col as series

1st     25
2nd     32
3rd     18
4th     47
5th     29
6th     36
7th     21
8th     45
9th     28
10th    33
Name: Age, dtype: int64

In [ ]:
df[['Age','Salary']] # return column with label col as dataframe

      Age  Salary
1st    25   50000
2nd    32   75000
3rd    18   40000
4th    47   90000
5th    29   60000
6th    36   80000
7th    21   55000
8th    45  100000
9th    28   65000
10th   33   70000

In [ ]:
df.to_numpy()

array([['Alice', 25, 'Female', 'USA', 50000, 'Marketing', 3, 'Bachelor'],
       ['Bob', 32, 'Male', 'Canada', 75000, 'Finance', 8, 'Master'],
       ['Charlie', 18, 'Male', 'USA', 40000, 'Marketing', 1,
        'High School'],
       ['David', 47, 'Male', 'Australia', 90000, 'IT', 18, 'PhD'],
       ['Emily', 29, 'Female', 'UK', 60000, 'IT', 6, 'Bachelor'],
       ['Frank', 36, 'Male', 'Canada', 80000, 'HR', 10, 'Master'],
       ['George', 21, 'Male', 'USA', 55000, 'Marketing', 2, 'Bachelor'],
       ['Helen', 45, 'Female', 'Australia', 100000, 'IT', 22, 'PhD'],
       ['Irene', 28, 'Female', 'UK', 65000, 'HR', 5, 'Bachelor'],
       ['Jack', 33, 'Male', 'USA', 70000, 'Finance', 7, 'Master']],
      dtype=object)

In [ ]:
# Let us get a subset which consists of first 8 rows and first 4 columns
df.iloc[:,:]

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor
2nd,Bob,32,Male,Canada,75000,Finance,8,Master
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School
4th,David,47,Male,Australia,90000,IT,18,PhD
5th,Emily,29,Female,UK,60000,IT,6,Bachelor
6th,Frank,36,Male,Canada,80000,HR,10,Master
7th,George,21,Male,USA,55000,Marketing,2,Bachelor
8th,Helen,45,Female,Australia,100000,IT,22,PhD
9th,Irene,28,Female,UK,65000,HR,5,Bachelor
10th,Jack,33,Male,USA,70000,Finance,7,Master

In [ ]:
df.sort_index(axis=0,ascending=True) #axis=0 column, axis=1 row

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
10th,Jack,33,Male,USA,70000,Finance,7,Master
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor
2nd,Bob,32,Male,Canada,75000,Finance,8,Master
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School
4th,David,47,Male,Australia,90000,IT,18,PhD
5th,Emily,29,Female,UK,60000,IT,6,Bachelor
6th,Frank,36,Male,Canada,80000,HR,10,Master
7th,George,21,Male,USA,55000,Marketing,2,Bachelor
8th,Helen,45,Female,Australia,100000,IT,22,PhD
9th,Irene,28,Female,UK,65000,HR,5,Bachelor

iloc gets rows (or columns) at particular positions in the index (so it only takes integers).

loc gets rows (or columns) with particular labels from the index.

In [ ]:
df.loc[:,['Age','Gender']] #return all rows

      Age  Gender
1st    25  Female
2nd    32    Male
3rd    18    Male
4th    47    Male
5th    29  Female
6th    36    Male
7th    21    Male
8th    45  Female
9th    28  Female
10th   33    Male

In [ ]:
df.loc[['1st','2nd'], :] #return all columns

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor
2nd,Bob,32,Male,Canada,75000,Finance,8,Master

In [ ]:
df.loc[:,:] #loc[rows,columns]

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor
2nd,Bob,32,Male,Canada,75000,Finance,8,Master
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School
4th,David,47,Male,Australia,90000,IT,18,PhD
5th,Emily,29,Female,UK,60000,IT,6,Bachelor
6th,Frank,36,Male,Canada,80000,HR,10,Master
7th,George,21,Male,USA,55000,Marketing,2,Bachelor
8th,Helen,45,Female,Australia,100000,IT,22,PhD
9th,Irene,28,Female,UK,65000,HR,5,Bachelor
10th,Jack,33,Male,USA,70000,Finance,7,Master

In [ ]:
# Now let us subset our dataframe in which we want to have first 8 rows identified with their rows labels and some named columns
#df.loc[5:8,['Age','Country']]

In [ ]:
df.loc[:,['Country']]

        Country
1st         USA
2nd      Canada
3rd         USA
4th   Australia
5th          UK
6th      Canada
7th         USA
8th   Australia
9th          UK
10th        USA

In [ ]:
df.iloc[0,0] #if work throgh index(integer based undexing)

'Alice'

In [ ]:
df[['Age','Country']]

      Age    Country
1st    25        USA
2nd    32     Canada
3rd    18        USA
4th    47  Australia
5th    29         UK
6th    36     Canada
7th    21        USA
8th    45  Australia
9th    28         UK
10th   33        USA

Boolean Indexing

In [ ]:
df['Country']=='USA'

1st      True
2nd     False
3rd      True
4th     False
5th     False
6th     False
7th      True
8th     False
9th     False
10th     True
Name: Country, dtype: bool

In [ ]:
USA_WALE=df[df['Country']=='USA']
USA_WALE.head()

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School
7th,George,21,Male,USA,55000,Marketing,2,Bachelor
10th,Jack,33,Male,USA,70000,Finance,7,Master

In [ ]:
USA_WALE=df[df['Country'] !='USA']
USA_WALE.head()

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
2nd,Bob,32,Male,Canada,75000,Finance,8,Master
4th,David,47,Male,Australia,90000,IT,18,PhD
5th,Emily,29,Female,UK,60000,IT,6,Bachelor
6th,Frank,36,Male,Canada,80000,HR,10,Master
8th,Helen,45,Female,Australia,100000,IT,22,PhD

In [ ]:
long_age= df[df['Age']>30]
long_age

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level
2nd,Bob,32,Male,Canada,75000,Finance,8,Master
4th,David,47,Male,Australia,90000,IT,18,PhD
6th,Frank,36,Male,Canada,80000,HR,10,Master
8th,Helen,45,Female,Australia,100000,IT,22,PhD
10th,Jack,33,Male,USA,70000,Finance,7,Master

In [ ]:
df['half_Age']= df['Age']*0.5

In [ ]:
df.head()

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,half_Age
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor,12.5
2nd,Bob,32,Male,Canada,75000,Finance,8,Master,16.0
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School,9.0
4th,David,47,Male,Australia,90000,IT,18,PhD,23.5
5th,Emily,29,Female,UK,60000,IT,6,Bachelor,14.5

In [ ]:
df['Total_Income']=df['Salary']*df['Years of Experience']

In [ ]:
df.head()

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,half_Age,Total_Income
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor,12.5,150000
2nd,Bob,32,Male,Canada,75000,Finance,8,Master,16.0,600000
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School,9.0,40000
4th,David,47,Male,Australia,90000,IT,18,PhD,23.5,1620000
5th,Emily,29,Female,UK,60000,IT,6,Bachelor,14.5,360000

In [ ]:
#Drop the column

df.drop(['half_Age'],axis = 1,inplace=True)

In [ ]:
df.head()

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income
1st,Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000
2nd,Bob,32,Male,Canada,75000,Finance,8,Master,600000
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School,40000
4th,David,47,Male,Australia,90000,IT,18,PhD,1620000
5th,Emily,29,Female,UK,60000,IT,6,Bachelor,360000

In [ ]:
df.drop(['1st','2nd']) #to drop a row

,Name,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income
3rd,Charlie,18,Male,USA,40000,Marketing,1,High School,40000
4th,David,47,Male,Australia,90000,IT,18,PhD,1620000
5th,Emily,29,Female,UK,60000,IT,6,Bachelor,360000
6th,Frank,36,Male,Canada,80000,HR,10,Master,800000
7th,George,21,Male,USA,55000,Marketing,2,Bachelor,110000
8th,Helen,45,Female,Australia,100000,IT,22,PhD,2200000
9th,Irene,28,Female,UK,65000,HR,5,Bachelor,325000
10th,Jack,33,Male,USA,70000,Finance,7,Master,490000

In [ ]:
df.drop(['Age'],axis=1) #To drop a column

,Name,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income
1st,Alice,Female,USA,50000,Marketing,3,Bachelor,150000
2nd,Bob,Male,Canada,75000,Finance,8,Master,600000
3rd,Charlie,Male,USA,40000,Marketing,1,High School,40000
4th,David,Male,Australia,90000,IT,18,PhD,1620000
5th,Emily,Female,UK,60000,IT,6,Bachelor,360000
6th,Frank,Male,Canada,80000,HR,10,Master,800000
7th,George,Male,USA,55000,Marketing,2,Bachelor,110000
8th,Helen,Female,Australia,100000,IT,22,PhD,2200000
9th,Irene,Female,UK,65000,HR,5,Bachelor,325000
10th,Jack,Male,USA,70000,Finance,7,Master,490000

In [ ]:
# Find the sum of values in a column
df['Salary'].sum()

685000

In [ ]:
#set column as index column
df.set_index('Name', inplace=True)

In [ ]:
df.head()

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income
Name,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000
Bob,32,Male,Canada,75000,Finance,8,Master,600000
Charlie,18,Male,USA,40000,Marketing,1,High School,40000
David,47,Male,Australia,90000,IT,18,PhD,1620000
Emily,29,Female,UK,60000,IT,6,Bachelor,360000

In [ ]:
a=df[df['Age']==32]
a

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income
Name,,,,,,,,
Bob,32,Male,Canada,75000,Finance,8,Master,600000

apply() method applies a function to every row in a pandas dataframe

In [ ]:
#uppercase
def to_uppercase(column):
    return column.upper()

In [ ]:
df['Capital_Name']=df['Country'].apply(to_uppercase)

In [ ]:
df.head()

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK

We can also sort our dataframe by some column values in either an ascending or descending order

In [ ]:
# Sort values in descending order
df.sort_values('Age', ascending=False)

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA

In [ ]:
# We can also sort by the combination of two columns
df.sort_values(['Age','Salary'], ascending=[False,True]).head()

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA

In [ ]:
# Find the list of unique values in a column
list(df['Country'].unique())

In [ ]:
df['Country'].unique()

In [ ]:
#df.columns=['N','A','B','C','D','E','F','G','H'] #rename of column
df

In [ ]:
df.isnull() #checks for null values, return boolean array

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,False,False,False,False,False,False,False,False,False
Bob,False,False,False,False,False,False,False,False,False
Charlie,False,False,False,False,False,False,False,False,False
David,False,False,False,False,False,False,False,False,False
Emily,False,False,False,False,False,False,False,False,False
Frank,False,False,False,False,False,False,False,False,False
George,False,False,False,False,False,False,False,False,False
Helen,False,False,False,False,False,False,False,False,False
Irene,False,False,False,False,False,False,False,False,False
Jack,False,False,False,False,False,False,False,False,False

In [ ]:
df.notnull() #opposite to isnull

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,True,True,True,True,True,True,True,True,True
Bob,True,True,True,True,True,True,True,True,True
Charlie,True,True,True,True,True,True,True,True,True
David,True,True,True,True,True,True,True,True,True
Emily,True,True,True,True,True,True,True,True,True
Frank,True,True,True,True,True,True,True,True,True
George,True,True,True,True,True,True,True,True,True
Helen,True,True,True,True,True,True,True,True,True
Irene,True,True,True,True,True,True,True,True,True
Jack,True,True,True,True,True,True,True,True,True

In [ ]:
df.dropna() #drop all rows contain null values

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
df.dropna(axis=1) #drop all columns contain null values

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
df.dropna(axis=1,thresh=1) #drop all columns contain null values less than n

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
df.fillna(df.mean()) #replace all null values with mean

C:\Users\RANJIT\AppData\Local\Temp\ipykernel_132488\234936199.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean()) #replace all null values with mean

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
#df.astype(float) #Convert datatype of series to float

In [ ]:
df.replace(1,'one') #replace all values equal to 1 with one

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,one,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
df.rename(columns={'N':'New Age'}) #rename of selected column

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
Charlie,18,Male,USA,40000,Marketing,1,High School,40000,USA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
df1.append(df2)  #add rows in end of df1 to the df2, column should be identical

NameError: name 'df1' is not defined

In [ ]:
pd.concat([df1,df2],axis=1) #add rows in end of df1 to the df2, rows should be identical

NameError: name 'df1' is not defined

**FILTER, SORT & GROUPBY **

In [ ]:
df

In [ ]:
df[df['Age']>20] #rows where age greater than 20

,Age,Gender,Country,Salary,Department,Years of Experience,Education Level,Total_Income,Capital_Name
Name,,,,,,,,,
Alice,25,Female,USA,50000,Marketing,3,Bachelor,150000,USA
Bob,32,Male,Canada,75000,Finance,8,Master,600000,CANADA
David,47,Male,Australia,90000,IT,18,PhD,1620000,AUSTRALIA
Emily,29,Female,UK,60000,IT,6,Bachelor,360000,UK
Frank,36,Male,Canada,80000,HR,10,Master,800000,CANADA
George,21,Male,USA,55000,Marketing,2,Bachelor,110000,USA
Helen,45,Female,Australia,100000,IT,22,PhD,2200000,AUSTRALIA
Irene,28,Female,UK,65000,HR,5,Bachelor,325000,UK
Jack,33,Male,USA,70000,Finance,7,Master,490000,USA

In [ ]:
df[(df['Age']>20) & (df['Age']<30)] #between

In [ ]:
df.sort_values('Age') #sort values also add ascending

In [ ]:
df.groupby('Gender') #create groupby object for values

In [ ]:
df.groupby('Gender'),['Country'] #for multiple

Statistical

In [ ]:
df.describe()

In [ ]:
df.mean()

In [ ]:
df.corr()

In [ ]:
df.count()

In [ ]:
df.max()

In [ ]:
df.min()

In [ ]:
df.median()

In [ ]:
df.std()

In [ ]:
import numpy as np

In [ ]:
lst=[1,2,3,4]  #convert list to array
arr=np.array(lst)                   #here is 1D array bcoz single bracket, for 2D double bracket [[]]

In [ ]:
type(arr)

numpy.ndarray

In [ ]:
arr.shape

(4,)

In [ ]:
#2D array

lis1=[1,2,3,4,5,6]
lis2=[1,2,4,5,6,7]
lis3=[1,5,4,6,7,8]

arr1=np.array([lis1,lis2,lis3])
arr1

array([[1, 2, 3, 4, 5, 6],
       [1, 2, 4, 5, 6, 7],
       [1, 5, 4, 6, 7, 8]])

In [ ]:
arr1.shape

(3, 6)

In [ ]:
arr

array([1, 2, 3, 4])

In [ ]:
#indexing

arr[3]

4

In [ ]:
arr[1:3]

array([2, 3])

In [ ]:
arr[::-1] #reverse

array([4, 3, 2, 1])

In [ ]:
#multidiamentional indexing [row:column]
arr1[:,1]

array([2, 2, 5])

In [ ]:
arr1[1:3,1:3]

array([[2, 4],
       [5, 4]])

In [ ]:
#EDA

In [ ]:
arr

array([1, 2, 3, 4])

In [ ]:
arr[arr<2]

array([ True, False, False, False])

In [ ]:
arr1

array([[1, 2, 3, 4, 5, 6],
       [1, 2, 4, 5, 6, 7],
       [1, 5, 4, 6, 7, 8]])

In [ ]:
arr1.reshape(9,2)  #must match total elements with original

array([[1, 2],
       [3, 4],
       [5, 6],
       [1, 2],
       [4, 5],
       [6, 7],
       [1, 5],
       [4, 6],
       [7, 8]])

In [ ]:
#mechanisam to create array

np.arange(1,11,1)

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [ ]:
np.arange(1,11,1).reshape(5,2)

array([[ 1,  2],
       [ 3,  4],
       [ 5,  6],
       [ 7,  8],
       [ 9, 10]])

In [ ]:
arr1*arr1 #multiplication

array([[ 1,  4,  9, 16, 25, 36],
       [ 1,  4, 16, 25, 36, 49],
       [ 1, 25, 16, 36, 49, 64]])

In [ ]:
np.ones((5,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [ ]:
np.zeros((3,2))

array([[0., 0.],
       [0., 0.],
       [0., 0.]])

In [ ]:
np.random.randint(20,63)

38

In [ ]:
np.random.randint(20,63,4)

array([41, 42, 42, 20])

In [ ]:
np.random.randint(20,63,4).reshape(2,2)

array([[21, 40],
       [38, 32]])

In [ ]:
#elementwise operation
a = np.array([1, 2, 3, 4])
b = np.array([2, 2, 2, 2])
print(a + b) # [3, 4, 5, 6]

[3 4 5 6]

In [ ]:
#martix operation
a = np.array([[1, 2], [3, 4]])
b = np.array([[5, 6], [7, 8]])
print(np.dot(a, b)) # [[19, 22], [43, 50]]

[[19 22]
 [43 50]]

In [ ]:
#concanetate numpy array
a = np.array([1, 2, 3])
b = np.array([4, 5, 6])
c = np.concatenate((a, b))
print(c) # [1, 2, 3, 4, 5, 6]

[1 2 3 4 5 6]

In [ ]:
#sort array
a = np.array([3, 1, 4, 2])
print(np.sort(a)) # [1, 2, 3, 4]

[1 2 3 4]

In [ ]:
#calculate mean of array
a = np.array([1, 2, 3, 4])
print(np.mean(a)) # 2.5
print(np.std(a)) # 1.118033988749895

2.5
1.118033988749895

In [ ]:
#max & min values in araay
a = np.array([1, 2, 3, 4])
print(np.max(a)) # 4
print(np.min(a)) # 1

4
1

In [ ]:
import numpy as np
a = np.array([1, 2, 3,4,5], ndmin = 5)
print (a)

[[[[[1 2 3 4 5]]]]]

In [ ]:
dt = np.dtype([('age',np.int8)])
a = np.array([(10,),(20,),(30,)], dtype = dt)
print (a['age'])

[10 20 30]